content/teaching/mat7093-2025S/index.md
+++
title = "MAT7093 Stochastic Analysis, 2025 Spring"
draft = false
+++

## Course Information {#course-information}

-   Time:
-   Location:
-   TA:


## Lecture note {#lecture-note}

[lecture note](../notes/stochastic-analysis-LN.pdf) (updated regularly)


## references {#references}

We will loosely follow Le Gall's presentation at the beginning, and then switch to KS, Chapters 5 and 6 for SDEs and Lévy's theory. KS chapters 1-4 can be a substitute for Le Gall but they are more technically involved.

-   Le Gall, Jean-François. Brownian Motion, Martingales, and Stochastic Calculus. Vol. 274. Graduate Texts in Mathematics. Cham: Springer International Publishing, 2016. <https://doi.org/10.1007/978-3-319-31089-3>.
-   Karatzas, Ioannis, and Steven Shreve. Brownian Motion and Stochastic Calculus. 2nd ed. Graduate Texts in Mathematics. New York: Springer-Verlag, 1998. <https://www.springer.com/us/book/9780387976556>.
-   Revuz, Daniel, and Marc Yor. Continuous Martingales and Brownian Motion. 3rd ed. Grundlehren Der Mathematischen Wissenschaften. Berlin Heidelberg: Springer-Verlag, 1999. <https://doi.org/10.1007/978-3-662-06400-9>.


## HW {#hw}

biweekly


## Grading scheme {#grading-scheme}

|                | %   |           |
|----------------|-----|-----------|
| HW assignments | 40% | bi-weekly |
| Final          | 60% |           |


## Schedule {#schedule}

| Week  | Content                                                                                                                                                                                                                                                                                                                                                                                                                              |
|-------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 1     | **Preliminaries**: stochastic processes, Gaussian spaces and Gaussian processes, measure theory on infinite-dimensional spaces.                                                                                                                                                                                                                                                                                                      |
| 2-4   | **Brownian motion and continuous martingales**: construction of Brownian motions, path properties; stopping times, continuous-time martingales, Optional Sampling Theorem, maximal inequality; the Doob-Meyer decomposition; filtration, augmentation and usual condition.                                                                                                                                                           |
| 5-9   | **Stochastic integrals**: continuous local martingales, quadratic and cross variation;  Construction of the Itô integral; technique of localization; the change-of-variable formula (Itô's Formula), semi-martingales; Lévy's characterization; representations of continuous martingales as time-change Brownian motion; continuous martingale as Brownian integrals; Girsanov theorem, exponential martingales, Novikov condition. |
| 10-14 | **Stochastic differential equations**: Feller semi-groups, generators; strong and weak solutions; Lipschitz case; pathwise uniqueness; Yamada--Watanabe Theorem; martingale problem, existence and uniqueness; strong Markov property for diffusion.                                                                                                                                                                                 |
| 12-13 | **Connection with partial differential equations**: representation of solutions via diffusion; Feynman--Kac Formula; Brownian motion and harmonic functions; regular boundary points; recurrence of Brownian motions, study of hitting time; Doob's \\(h\\)-transform and conditioned diffusion.                                                                                                                                     |
| 14-15 | **Local time**: Tanaka's Formula, generalized Itô's Formula, Ray--Knight Theorem, Lévy's Theory.                                                                                                                                                                                                                                                                                                                                     |
